 
 &НаСервере
 Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 Объект.ПоВсемТоварам = Истина;
	 Элементы.Номенклатура.Видимость = Ложь;
	 
	 Сервер = "bank.gov.ua";
	 Порт = 443;
	 Логин = "";
	 Пароль = "";
	 Сервис = "/NBUStatService/v1/statdirectory/exchange?json";
	 
	 Ssl = Новый ЗащищенноеСоединениеOpenSSL();
	 Прокси = Новый ИнтернетПрокси(Ложь);
	 СоединениеHTTP = Новый HTTPСоединение(Сервер, Порт, Логин, Пароль, Прокси,,Ssl);
	 
	 Заголовки = Новый Соответствие;
	 
	 ЗапросHTTP = Новый HTTPЗапрос(Сервис, Заголовки);
	 
	 Результат = СоединениеHTTP.Получить(ЗапросHTTP);
	 
	 Если Результат.КодСостояния <> 200 Тогда
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "Не удалось загрузить курс"+ОписаниеОшибки();
		 Сообщение.Сообщить();
	 КонецЕсли;
	 
	 Данные = Результат.ПолучитьТелоКакСтроку();
	 
	 Чтениеjson = новый Чтениеjson;
	 Чтениеjson.УстановитьСтроку(Данные);
	 ДанныеМасива = ПрочитатьJSON(Чтениеjson);
	 Для каждого Значения  Из ДанныеМасива Цикл
		 Если Значения.txt = "Долар США" тогда
			 Объект.ДолларСша = Значения.rate;
		 КонецЕсли; 
		 Если  Значения.txt = "Євро" тогда
			 Объект.Євро = Значения.rate;   
		 КонецЕсли
	 КонецЦикла; 
	 
 КонецПроцедуры
 
 &НаСервере
 Процедура ВкладкиПриСменеСтраницыНаСервере()
	 
 КонецПроцедуры
 
 &НаКлиенте
 Процедура ВкладкиПриСменеСтраницы(Элемент, ТекущаяСтраница) 
	 
	 ВыбраннаяСтраница = Элемент.ТекущаяСтраница.Имя;
	 Если ВыбраннаяСтраница = "АнализПродаж" Тогда
		 Объект.Товары.Очистить();
		 ОчиститьСообщения();
		 СформироватьНаСервере()
		 
	 ИначеЕсли ВыбраннаяСтраница = "Рентабельность" Тогда
		 Объект.Товары.Очистить();
		 ОчиститьСообщения();
		 ЗаполнитьТаблицуРентабельность();
		 
	 ИначеЕсли ВыбраннаяСтраница = "Топ10" Тогда
		 //Объект.Товары.Очистить();
		 ОчиститьСообщения();
		 ТопТоваров() 
		 
	ИначеЕсли ВыбраннаяСтраница = "ТоварБезСпроса" Тогда
		 //Объект.Товары.Очистить();
		 ОчиститьСообщения();
		 ТовырыБезПродаж() 
		 
	ИначеЕсли ВыбраннаяСтраница = "ЛучшиеПродавцы" Тогда
		 //Объект.Товары.Очистить();
		 ОчиститьСообщения();
		 ЛучшиеМенеджерыПродавцы()
	 КонецЕсли;
	 
 КонецПроцедуры 
 
 &НаСервере
 Процедура ЗаполнитьТаблицуРентабельность();
	 Объект.Товары.Очистить();
	 Если Объект.ПоВсемТоварам = Ложь Тогда
		 Запрос = Новый Запрос;
		 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
		 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот, 0)) КАК КоличествоОборот,
		 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот, 0)) КАК СуммаВыручкиОборот,
		 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот, 0)) КАК СтоимостьОборот
		 |ПОМЕСТИТЬ ВТ_ДанныеТаблиц
		 |ИЗ
		 |	Справочник.Номенклатура КАК Номенклатура
		 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&ДатаНачала, &ДатаКонца, , АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура) КАК ВыручкаИСебестоимостьПродажОбороты
		 |		ПО Номенклатура.Ссылка = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
		 |ГДЕ
		 |	Номенклатура.ЭтоГруппа = ЛОЖЬ
		 |	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
		 |
		 |ИМЕЮЩИЕ
		 |	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) >= 1
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	вт.АналитикаУчетаНоменклатурыНоменклатура КАК Номенклатура,
		 |	ЕСТЬNULL(ВЫБОР
		 |			КОГДА вт.СуммаВыручкиОборот = 0
		 |					ИЛИ вт.СтоимостьОборот = 0
		 |				ТОГДА 0
		 |			ИНАЧЕ (вт.СуммаВыручкиОборот - вт.СтоимостьОборот) / вт.СтоимостьОборот * 100
		 |		КОНЕЦ, 0) КАК Рентабельность
		 |ИЗ
		 |	ВТ_ДанныеТаблиц КАК вт
		 |
		 |УПОРЯДОЧИТЬ ПО
		 |	Номенклатура УБЫВ";
		 
		 Запрос.УстановитьПараметр("ДатаКонца", Объект.КонецПериода);
		 Запрос.УстановитьПараметр("ДатаНачала", Объект.НачалоПериода);
		 Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);
		 
		 
		 РезультатЗапроса = Запрос.Выполнить();
		 Выборка = РезультатЗапроса.Выбрать();
		 
		 Пока Выборка.Следующий() Цикл
			 НоваяСтрока = Объект.Товары.Добавить();
			 ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		 КонецЦикла;
		 		 
	 ИначеЕсли
		 Объект.ПоВсемТоварам = Истина Тогда
		 Объект.Товары.Очистить();
		 Запрос = Новый Запрос;
		 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
		 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот, 0)) КАК КоличествоОборот,
		 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот, 0)) КАК СуммаВыручкиОборот,
		 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот, 0)) КАК СтоимостьОборот
		 |ПОМЕСТИТЬ ВТ_ДанныеТаблиц
		 |ИЗ
		 |	Справочник.Номенклатура КАК Номенклатура
		 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&ДатаНачала, &ДатаКонца, , ) КАК ВыручкаИСебестоимостьПродажОбороты
		 |		ПО Номенклатура.Ссылка = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
		 |ГДЕ
		 |	Номенклатура.ЭтоГруппа = ЛОЖЬ
		 |	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
		 |
		 |ИМЕЮЩИЕ
		 |	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) >= 1
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	вт.АналитикаУчетаНоменклатурыНоменклатура КАК Номенклатура,
		 |	СУММА(ЕСТЬNULL(ВЫБОР
		 |				КОГДА вт.СуммаВыручкиОборот = 0
		 |						ИЛИ вт.СтоимостьОборот = 0
		 |					ТОГДА 0
		 |				ИНАЧЕ (вт.СуммаВыручкиОборот - вт.СтоимостьОборот) / вт.СтоимостьОборот * 100
		 |			КОНЕЦ, 0)) КАК Рентабельность
		 |ИЗ
		 |	ВТ_ДанныеТаблиц КАК вт
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	вт.АналитикаУчетаНоменклатурыНоменклатура
		 |
		 |УПОРЯДОЧИТЬ ПО
		 |	Рентабельность УБЫВ";
		 
		 Запрос.УстановитьПараметр("ДатаКонца",Объект.КонецПериода);
		 Запрос.УстановитьПараметр("ДатаНачала", Объект.НачалоПериода);
		 
		 РезультатЗапроса = Запрос.Выполнить();
		 
		 Выборка = РезультатЗапроса.Выбрать();
		 
		 Пока Выборка.Следующий() Цикл
			 НоваяСтрока = Объект.Товары.Добавить();
			 ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		 КонецЦикла;
		 
		 Объект.Товары.Сортировать("Рентабельность Убыв");
	 КонецЕсли
 КонецПроцедуры
 
 &НаСервере
 Процедура СформироватьНаСервере()
	 Объект.Товары.Очистить();
	 Если   Объект.Номенклатура = Справочники.Номенклатура.ПустаяСсылка() и Объект.ПоВсемТоварам = Ложь тогда
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "Заполните значение номенклатуры!";
		 Сообщение.Сообщить();
		 Возврат;
	 КонецЕсли;  
	 
	 Если Объект.ПоВсемТоварам = Ложь Тогда
		 
		 Запрос = Новый Запрос;
		 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
		 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот, 0)) КАК КоличествоОборот,
		 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот, 0)) КАК СуммаВыручкиОборот,
		 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот, 0)) КАК СтоимостьОборот
		 |ПОМЕСТИТЬ ВТ_ДанныеТаблиц
		 |ИЗ
		 |	Справочник.Номенклатура КАК Номенклатура
		 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&ДатаНачала, &ДатаКонца, , АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура) КАК ВыручкаИСебестоимостьПродажОбороты
		 |		ПО Номенклатура.Ссылка = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
		 |ГДЕ
		 |	Номенклатура.ЭтоГруппа = ЛОЖЬ
		 |	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
		 |
		 |ИМЕЮЩИЕ
		 |	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) >= 1
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	вт.АналитикаУчетаНоменклатурыНоменклатура КАК Номенклатура,
		 |	вт.КоличествоОборот КАК КоличествоПродаж,
		 |	вт.СуммаВыручкиОборот КАК СуммаПродаж,
		 |	вт.СтоимостьОборот КАК Себестоимость,
		 |	ЕСТЬNULL(ВЫБОР
		 |			КОГДА вт.СтоимостьОборот = 0
		 |					ИЛИ вт.СуммаВыручкиОборот = 0
		 |				ТОГДА 0
		 |			ИНАЧЕ вт.СуммаВыручкиОборот - вт.СтоимостьОборот
		 |		КОНЕЦ, 0) КАК Прибыль,
		 |	ЕСТЬNULL(ВЫБОР
		 |			КОГДА вт.СуммаВыручкиОборот = 0
		 |					ИЛИ вт.СтоимостьОборот = 0
		 |				ТОГДА 0
		 |			ИНАЧЕ (вт.СуммаВыручкиОборот - вт.СтоимостьОборот) / вт.СтоимостьОборот * 100
		 |		КОНЕЦ, 0) КАК Рентабельность
		 |ИЗ
		 |	ВТ_ДанныеТаблиц КАК вт";
		 
		 Запрос.УстановитьПараметр("ДатаКонца", Объект.КонецПериода);
		 Запрос.УстановитьПараметр("ДатаНачала", Объект.НачалоПериода);
		 Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);
		 
		 РезультатЗапроса = Запрос.Выполнить();
		 Если РезультатЗапроса.Пустой()  Тогда
		  Сообщение = Новый СообщениеПользователю;
		  Сообщение.Текст = " По Номенклатуре:"+" "+"(___"+Объект.Номенклатура+"___)"+" "+"за выбранный период продаж не было!";
		  Сообщение.Сообщить();
	     КонецЕсли; 
	  
		 Выборка = РезультатЗапроса.Выбрать();
		 
		 Пока Выборка.Следующий() Цикл
			 НоваяСтрока = Объект.Товары.Добавить();
			 ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
			 
		 КонецЦикла;  
		 
	 ИначеЕсли
		 Объект.ПоВсемТоварам = Истина Тогда
		 Объект.Товары.Очистить();	
		 ПоВсемТоварам();
	 КонецЕсли;
	 
 КонецПроцедуры
 
 &НаКлиенте
 Процедура Сформировать(Команда)
	 ОчиститьСообщения();
	 СформироватьНаСервере();
 КонецПроцедуры
 
 &НаСервере
 Процедура ПоВсемТоварамПриИзмененииНаСервере()
	 Если Объект.ПоВсемТоварам = Истина Тогда
		 Объект.Товары.Очистить();
		 Объект.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		 Элементы.Номенклатура.Видимость = Ложь; 
		 Элементы.Товары3Данные.Обновить();
		 Элементы.Товары4Данные.Обновить();
		 Элементы.Товары2.Обновить();	
		 Элементы.Товары1.Обновить();
		 
	 КонецЕсли;
	 
	 Если Объект.ПоВсемТоварам = Ложь Тогда
		 Объект.Товары.Очистить();
		 Объект.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		 Элементы.Номенклатура.Видимость = Истина; 
		 Сообщение = Новый СообщениеПользователю; 
		 Сообщение.Текст = "Для Формирования Отчета заполните значение реквизита номенклатура";
		 Сообщение.Сообщить();
	 КонецЕсли; 
	 
КонецПроцедуры
 
 &НаКлиенте
 Процедура ПоВсемТоварамПриИзменении(Элемент)
	 ОчиститьСообщения();
	 ПоВсемТоварамПриИзмененииНаСервере();
 КонецПроцедуры
 
 &НаСервере
 Процедура ПоВсемТоварам()
	 Объект.Товары.Очистить();
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
	 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот, 0)) КАК КоличествоОборот,
	 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот, 0)) КАК СуммаВыручкиОборот,
	 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот, 0)) КАК СтоимостьОборот
	 |ПОМЕСТИТЬ ВТ_ДанныеТаблиц
	 |ИЗ
	 |	Справочник.Номенклатура КАК Номенклатура
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&ДатаНачала, &ДатаКонца, , ) КАК ВыручкаИСебестоимостьПродажОбороты
	 |		ПО Номенклатура.Ссылка = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
	 |ГДЕ
	 |	Номенклатура.ЭтоГруппа = ЛОЖЬ
	 |	И Номенклатура.ПометкаУдаления = ЛОЖЬ
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
	 |
	 |ИМЕЮЩИЕ
	 |	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) >= 1
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	вт.АналитикаУчетаНоменклатурыНоменклатура КАК Номенклатура,
	 |	вт.КоличествоОборот КАК КоличествоПродаж,
	 |	вт.СуммаВыручкиОборот КАК СуммаПродаж,
	 |	вт.СтоимостьОборот КАК Себестоимость,
	 |	ЕСТЬNULL(ВЫБОР
	 |			КОГДА вт.СтоимостьОборот = 0
	 |					ИЛИ вт.СуммаВыручкиОборот = 0
	 |				ТОГДА 0
	 |			ИНАЧЕ вт.СуммаВыручкиОборот - вт.СтоимостьОборот
	 |		КОНЕЦ, 0) КАК Прибыль,
	 |	ЕСТЬNULL(ВЫБОР
	 |			КОГДА вт.СуммаВыручкиОборот = 0
	 |					ИЛИ вт.СтоимостьОборот = 0
	 |				ТОГДА 0
	 |			ИНАЧЕ (вт.СуммаВыручкиОборот - вт.СтоимостьОборот) / вт.СтоимостьОборот * 100
	 |		КОНЕЦ, 0) КАК Рентабельность
	 |ИЗ
	 |	ВТ_ДанныеТаблиц КАК вт
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	Прибыль УБЫВ";
	 
	 Запрос.УстановитьПараметр("ДатаКонца", Объект.КонецПериода);
	 Запрос.УстановитьПараметр("ДатаНачала", Объект.НачалоПериода);
	 
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 Выборка = РезультатЗапроса.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 НоваяСтрока = Объект.Товары.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	 КонецЦикла;
	 
 КонецПроцедуры
 
 
 &НаСервере
 Процедура ТопТоваров()
	 Объект.Товары.Очистить();
	 Если Объект.ПоВсемТоварам = истина Тогда
		 
		 Запрос = Новый Запрос;
		 Запрос.Текст = 
		 "ВЫБРАТЬ ПЕРВЫЕ 10
		 |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
		 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот, 0)) КАК КоличествоОборот,
		 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот, 0)) КАК СуммаВыручкиОборот,
		 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот, 0)) КАК СтоимостьОборот
		 |ПОМЕСТИТЬ ВТ_ДанныеТаблиц
		 |ИЗ
		 |	Справочник.Номенклатура КАК Номенклатура
		 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&ДатаНачала, &ДатаКонца, , ) КАК ВыручкаИСебестоимостьПродажОбороты
		 |		ПО Номенклатура.Ссылка = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
		 |ГДЕ
		 |	Номенклатура.ЭтоГруппа = ЛОЖЬ
		 |	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
		 |
		 |ИМЕЮЩИЕ
		 |	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) >= 1
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	вт.АналитикаУчетаНоменклатурыНоменклатура КАК Номенклатура,
		 |	вт.КоличествоОборот КАК КоличествоПродаж
		 |ИЗ
		 |	ВТ_ДанныеТаблиц КАК вт
		 |
		 |УПОРЯДОЧИТЬ ПО
		 |	КоличествоПродаж УБЫВ";
		 
		 Запрос.УстановитьПараметр("ДатаКонца", Объект.КонецПериода);
		 Запрос.УстановитьПараметр("ДатаНачала", Объект.НачалоПериода);	
		 
		 Товары3Данные.Очистить(); 
		 Товары3Данные.Загрузить(Запрос.Выполнить().Выгрузить());	
		 
		 
		 Запрос = Новый Запрос;
		 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
		 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот, 0)) КАК КоличествоОборот,
		 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот, 0)) КАК СуммаВыручкиОборот,
		 |	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот, 0)) КАК СтоимостьОборот
		 |ПОМЕСТИТЬ ВТ_ДанныеТаблиц
		 |ИЗ
		 |	Справочник.Номенклатура КАК Номенклатура
		 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&ДатаНачала, &ДатаКонца, , ) КАК ВыручкаИСебестоимостьПродажОбороты
		 |		ПО Номенклатура.Ссылка = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
		 |ГДЕ
		 |	Номенклатура.ЭтоГруппа = ЛОЖЬ
		 |	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
		 |
		 |ИМЕЮЩИЕ
		 |	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) >= 1
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ ПЕРВЫЕ 10
		 |	вт.АналитикаУчетаНоменклатурыНоменклатура КАК Номенклатура,
		 |	СУММА(вт.СуммаВыручкиОборот) КАК СуммаПродаж
		 |ИЗ
		 |	ВТ_ДанныеТаблиц КАК вт
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	вт.АналитикаУчетаНоменклатурыНоменклатура
		 |
		 |УПОРЯДОЧИТЬ ПО
		 |	СуммаПродаж УБЫВ";
		 
		 Запрос.УстановитьПараметр("ДатаКонца", Объект.КонецПериода);
		 Запрос.УстановитьПараметр("ДатаНачала", Объект.НачалоПериода);
		 
		 
		 Товары4Данные.Очистить(); 
		 Товары4Данные.Загрузить(Запрос.Выполнить().Выгрузить());	
	 КонецЕсли;
КонецПроцедуры

//Получение Товаров по которым не было продаж за выбранный период
&НаСервере
Процедура ТовырыБезПродаж()
 	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
		|	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот, 0)) КАК КоличествоОборот,
		|	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот, 0)) КАК СуммаВыручкиОборот,
		|	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот, 0)) КАК СтоимостьОборот
		|ПОМЕСТИТЬ ВТ_ДанныеТаблиц
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&ДатаНачала, &ДатаКонца, , ) КАК ВыручкаИСебестоимостьПродажОбороты
		|		ПО Номенклатура.Ссылка = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ЛОЖЬ
		|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 20
		|	ВЫБОР
		|		КОГДА вт.АналитикаУчетаНоменклатурыНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ТОГДА ""Без Наименования""
		|		ИНАЧЕ вт.АналитикаУчетаНоменклатурыНоменклатура
		|	КОНЕЦ КАК Наименование,
		|	СУММА(вт.КоличествоОборот) КАК КоличествоПродаж
		|ИЗ
		|	ВТ_ДанныеТаблиц КАК вт
		|ГДЕ
		|	вт.АналитикаУчетаНоменклатурыНоменклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА вт.АналитикаУчетаНоменклатурыНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ТОГДА ""Без Наименования""
		|		ИНАЧЕ вт.АналитикаУчетаНоменклатурыНоменклатура
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоличествоПродаж";
	
	Запрос.УстановитьПараметр("ДатаКонца", Объект.КонецПериода);
	Запрос.УстановитьПараметр("ДатаНачала", Объект.НачалоПериода);
	
	ТоварБезСпроса.Очистить();
	ТоварБезСпроса.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры 

//Получение Списка Лучших менеджеров по продажам 
&НаСервере
Процедура ЛучшиеМенеджерыПродавцы()
 	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
		|	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот, 0)) КАК КоличествоОборот,
		|	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот, 0)) КАК СуммаВыручкиОборот,
		|	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СтоимостьОборот, 0)) КАК СтоимостьОборот,
		|	ВыручкаИСебестоимостьПродажОбороты.Менеджер КАК Менеджер
		|ПОМЕСТИТЬ ВТ_ДанныеТаблиц
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&ДатаНачала, &ДатаКонца, , ) КАК ВыручкаИСебестоимостьПродажОбороты
		|		ПО Номенклатура.Ссылка = ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ЛОЖЬ
		|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура,
		|	ВыручкаИСебестоимостьПродажОбороты.Менеджер
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) >= 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(вт.КоличествоОборот) КАК КоличествоПродаж,
		|	СУММА(вт.СуммаВыручкиОборот) КАК СуммаПродаж,
		|	ВЫБОР
		|		КОГДА вт.Менеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|			ТОГДА ""Без ФИО""
		|		ИНАЧЕ вт.Менеджер
		|	КОНЕЦ КАК Менеджер
		|ИЗ
		|	ВТ_ДанныеТаблиц КАК вт
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА вт.Менеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|			ТОГДА ""Без ФИО""
		|		ИНАЧЕ вт.Менеджер
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СуммаПродаж УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаКонца", Объект.КонецПериода);
	Запрос.УстановитьПараметр("ДатаНачала", Объект.НачалоПериода);
	
	ЛучшиеПродавцы.Очистить();                                             	
	ЛучшиеПродавцы.Загрузить(Запрос.Выполнить().Выгрузить());
	

КонецПроцедуры  
 
